ljgabc/rtthread/bsp/n32g003/library/n32g003_tim.h
    uint16_t Break; /* Specifies whether the TIM Break input is enabled or not.
                             This parameter can be a value of Break_Input_enable_disable */

    uint16_t BreakPolarity; /* Specifies the TIM Break Input pin polarity.
                                     This parameter can be a value of Break_Polarity */

    uint16_t AutomaticOutput; /* Specifies whether the TIM Automatic Output feature is enabled or not.
                                       This parameter can be a value of TIM_AOE_Bit_Set_Reset */
    bool IomBreakEn;          /* EXTENDMODE valid, open iom as break in*/
    bool LockUpBreakEn;       /* EXTENDMODE valid, open lockup(hardfault) as break in*/
    bool PvdBreakEn;          /* EXTENDMODE valid, open pvd(sys voltage too high or too low) as break in*/
} TIM_BDTRInitType;




#define TIM_REG16_BIT_ZERO    ((uint16_t)0x0000)
#define TIM_REG32_BIT_ZERO  ((uint32_t)0x00000000)

#define TIM_AR_PRELOAD_MASK     (TIM_CTRL1_ARPEN)
/** TIM_AR_PRELOAD **/
#define TIM_AR_PRELOAD_ENABLE   (TIM_CTRL1_ARPEN)
#define TIM_AR_PRELOAD_DISABLE  (TIM_REG32_BIT_ZERO)

#define TIM_UPRS_MASK       (TIM_CTRL1_UPRS)
/** TIM_Update_Source **/
#define TIM_UPRS_GLOBAL     (TIM_REG32_BIT_ZERO)
#define TIM_UPRS_REGULAR    (TIM_CTRL1_UPRS)

#define TIM_UPDATE_SRC_GLOBAL   (TIM_REG16_BIT_ZERO) /* Source of update is the counter overflow/underflow              \
                                                         or the setting of UG bit, or an update generation             \
                                                         through the slave mode controller. */
#define TIM_UPDATE_SRC_REGULAR ((uint16_t)0x0001) /* Source of update is counter overflow/underflow. */

#define TIM_UPDIS_MASK             (TIM_CTRL1_UPDIS)
/** TIM_Update_Disable **/
#define TIM_UPDATE_EVENT_DISABLE   (TIM_CTRL1_UPDIS)
#define TIM_UPDATE_EVENT_ENABLE    (TIM_REG32_BIT_ZERO)

#define TIM_ON_MASK                (TIM_CTRL1_CNTEN)
/** TIM_On **/
#define TIM_ON                     (TIM_CTRL1_CNTEN)

/* TIM_Break_In_Source */
#define TIM_LOCKUP_AS_BREAK_IN                  (TIM_CTRL1_LBKPEN)
#define TIM_PVD_AS_BREAK_IN                     (TIM_CTRL1_PBKPEN)
#define TIM_COMP_AS_BREAK_IN                    (TIM_CTRL1_IOMBKPEN)

#define TIM_CCUSEL_MASK                         (TIM_CTRL2_CCUSEL)
/** TIM_CCUSEL **/
#define TIM_CCUSEL_COM_AND_TRIG                 (TIM_CTRL2_CCUSEL)
#define TIM_CCUSEL_COM                          (TIM_REG32_BIT_ZERO)

/** TIM_CCPCTL **/
#define TIM_CCPCTL_MASK                         (TIM_CTRL2_CCPCTL)
#define TIM_CCPCTL_PRELOAD                      (TIM_CTRL2_CCPCTL)
#define TIM_CCPCTL_NOT_PRELOAD                  (TIM_REG32_BIT_ZERO)

/** TIM_REPCNT MASK**/
#define TIM_REPCNT_MASK             (TIM_REPCNT_REPCNT)

#define TIM_OC1MODE_MASK            (TIM_CCMOD1_OC1MD)
#define TIM_OC2MODE_MASK            (TIM_CCMOD1_OC2MD)
#define TIM_OC3MODE_MASK            (TIM_CCMOD2_OC3MD)
#define TIM_OC4MODE_MASK            (TIM_CCMOD2_OC4MD)
#define TIM_OC5MODE_MASK            (TIM_CCMOD3_OC5MD)
/** TIM_Output_Compare_and_PWM_modes**/
#define TIM_OCMODE_TIMING           (TIM_REG16_BIT_ZERO)
#define TIM_OCMODE_ACTIVE           (TIM_CCMOD1_OC1MD_0)
#define TIM_OCMODE_INACTIVE         (TIM_CCMOD1_OC1MD_1)
#define TIM_OCMODE_TOGGLE           (TIM_CCMOD1_OC1MD_0 | TIM_CCMOD1_OC1MD_1)
#define TIM_OCMODE_PWM1             (TIM_CCMOD1_OC1MD_2 | TIM_CCMOD1_OC1MD_1)
#define TIM_OCMODE_PWM2             (TIM_CCMOD1_OC1MD_2 | TIM_CCMOD1_OC1MD_1 | TIM_CCMOD1_OC1MD_2 | TIM_CCMOD1_OC1MD_0)
#define TIM_FORCED_ACTION_ACTIVE    (TIM_CCMOD1_OC1MD_2 | TIM_CCMOD1_OC1MD_0)
#define TIM_FORCED_ACTION_INACTIVE  (TIM_CCMOD1_OC1MD_2)

#define TIM_OPMODE_MASK     (TIM_CTRL1_ONEPM)
/** TIM_One_Pulse_Mode **/
#define TIM_OPMODE_SINGLE   (TIM_CTRL1_ONEPM)
#define TIM_OPMODE_REPET    (TIM_REG16_BIT_ZERO)

/** Channel **/
#define TIM_CH_1 ((uint16_t)0x0000)
#define TIM_CH_2 ((uint16_t)0x0004)
#define TIM_CH_3 ((uint16_t)0x0008)
#define TIM_CH_4 ((uint16_t)0x000C)
#define TIM_CH_5 ((uint16_t)0x0010)

#define TIM_CLK_DIV_MASK     (TIM_CTRL1_CLKD)
/** TIM_Clock_Division_CKD **/
#define TIM_CLK_DIV1         (TIM_REG16_BIT_ZERO)
#define TIM_CLK_DIV2         (TIM_CTRL1_CLKD_0)
#define TIM_CLK_DIV4         (TIM_CTRL1_CLKD_1)

#define TIM_CNT_MODE_MASK          (TIM_CTRL1_DIR | TIM_CTRL1_CAMSEL)
/** TIM_Counter_Mode **/
#define TIM_CNT_MODE_UP            (TIM_REG16_BIT_ZERO)
#define TIM_CNT_MODE_DOWN          (TIM_CTRL1_DIR)
#define TIM_CNT_MODE_CENTER_ALIGN1 (TIM_CTRL1_CAMSEL_0)
#define TIM_CNT_MODE_CENTER_ALIGN2 (TIM_CTRL1_CAMSEL_1)
#define TIM_CNT_MODE_CENTER_ALIGN3 (TIM_CTRL1_CAMSEL_1 | TIM_CTRL1_CAMSEL_0)





/** TIM_CHxSEL **/
#define TIM_CH1_SEL                (TIM_CTRL1_C1SEL)


/** TIM_OCREF_CLEAR_SEL **/
#define TIM_OCREF_CLEAR_SEL        (TIM_CTRL1_CLRSEL)

/** TIM_TI1_SEL **/
#define TIM_TI1_SEL                (TIM_CTRL2_TI1SEL)


/** TIM_ETR_Selection **/
#define TIM_ETR_SEL                (TIM_CTRL2_TSCSEL)


#define TIM_OC_POLARITY_MASK       (TIM_CCEN_CC1P)
/** TIM_Output_Compare_Polarity **/
#define TIM_OC_POLARITY_HIGH       (TIM_REG16_BIT_ZERO)
#define TIM_OC_POLARITY_LOW        (TIM_CCEN_CC1P)

#define TIM_OCN_POLARITY_MASK      (TIM_CCEN_CC1NP)
/** TIM_Output_Compare_N_Polarity **/
#define TIM_OCN_POLARITY_HIGH      (TIM_REG16_BIT_ZERO)
#define TIM_OCN_POLARITY_LOW       (TIM_CCEN_CC1NP)

/** TIM_Output_Compare_state **/
#define TIM_OUTPUT_STATE_DISABLE (TIM_REG16_BIT_ZERO)
#define TIM_OUTPUT_STATE_ENABLE  (TIM_CCEN_CC1EN)

/** TIM_Output_Compare_N_state **/
#define TIM_OUTPUT_NSTATE_DISABLE (TIM_REG16_BIT_ZERO)
#define TIM_OUTPUT_NSTATE_ENABLE  (TIM_CCEN_CC1NEN)

/** TIM_Capture_Compare_state **/
#define TIM_CAP_CMP_ENABLE    (TIM_CCEN_CC1EN)
#define TIM_CAP_CMP_DISABLE   (TIM_REG16_BIT_ZERO)

/** TIM_Capture_Compare_N_state **/
#define TIM_CAP_CMP_N_ENABLE    (TIM_CCEN_CC1NEN)
#define TIM_CAP_CMP_N_DISABLE   (TIM_REG16_BIT_ZERO)

/** Break_Input_enable_disable **/
#define TIM_BREAK_IN_ENABLE      (TIM_BKDT_BKEN)
#define TIM_BREAK_IN_DISABLE     (TIM_REG16_BIT_ZERO)

