ljgabc/rtthread/bsp/n32g003/library/n32g003_tim.h
/** Break_Polarity **/
#define TIM_BREAK_POLARITY_LOW       (TIM_REG16_BIT_ZERO)
#define TIM_BREAK_POLARITY_HIGH      (TIM_BKDT_BKP)

/** TIM_AOEN_Bit_Set_Reset **/
#define TIM_AUTO_OUTPUT_ENABLE      (TIM_BKDT_AOEN)
#define TIM_AUTO_OUTPUT_DISABLE     (TIM_REG16_BIT_ZERO)

/** TIM_MOEN_Bit_Set_Reset **/
#define TIM_MAIN_OUTPUT_ENABLE      (TIM_BKDT_MOEN)
#define TIM_MAIN_OUTPUT_DISABLE     (TIM_REG16_BIT_ZERO)

/** Lock_level **/
#define TIM_LOCK_LEVEL_OFF (TIM_REG16_BIT_ZERO)
#define TIM_LOCK_LEVEL_1   (TIM_BKDT_LCKCFG_0)
#define TIM_LOCK_LEVEL_2   (TIM_BKDT_LCKCFG_1)
#define TIM_LOCK_LEVEL_3   (TIM_BKDT_LCKCFG_1 | TIM_BKDT_LCKCFG_0)

/** OSSI_Off_State_Selection_for_Idle_mode_state **/
#define TIM_OSSI_STATE_ENABLE  (TIM_BKDT_OSSI)
#define TIM_OSSI_STATE_DISABLE (TIM_REG16_BIT_ZERO)

/** OSSR_Off_State_Selection_for_Run_mode_state **/
#define TIM_OSSR_STATE_ENABLE  (TIM_BKDT_OSSR)
#define TIM_OSSR_STATE_DISABLE (TIM_REG16_BIT_ZERO)

#define TIM_OC1_IDLE_STATE_MASK           (TIM_CTRL2_OI1)
#define TIM_OC2_IDLE_STATE_MASK           (TIM_CTRL2_OI2)
#define TIM_OC3_IDLE_STATE_MASK           (TIM_CTRL2_OI3)
#define TIM_OC4_IDLE_STATE_MASK           (TIM_CTRL2_OI4)
#define TIM_OC5_IDLE_STATE_MASK           (TIM_CTRL2_OI5)
/** TIM_Output_Compare_Idle_State **/
#define TIM_OC_IDLE_STATE_SET             (TIM_CTRL2_OI1)
#define TIM_OC_IDLE_STATE_RESET           (TIM_REG16_BIT_ZERO)

#define TIM_OC1N_IDLE_STATE_MASK           (TIM_CTRL2_OI1N)
#define TIM_OC2N_IDLE_STATE_MASK           (TIM_CTRL2_OI2N)
#define TIM_OC3N_IDLE_STATE_MASK           (TIM_CTRL2_OI3N)
/** TIM_Output_Compare_N_Idle_State **/
#define TIM_OCN_IDLE_STATE_SET   (TIM_CTRL2_OI1N)
#define TIM_OCN_IDLE_STATE_RESET (TIM_REG16_BIT_ZERO)

/** TIM_Input_Capture_Polarity **/
#define TIM_IC_POLARITY_RISING   (TIM_REG16_BIT_ZERO)
#define TIM_IC_POLARITY_FALLING  (TIM_CCEN_CC1P)
#define TIM_IC_POLARITY_BOTHEDGE (TIM_CCEN_CC1P | TIM_CCEN_CC1NP)

#define TIM_IC1_SELECTION_MASK         (TIM_CCMOD1_CC1SEL)
#define TIM_IC2_SELECTION_MASK         (TIM_CCMOD1_CC2SEL)
#define TIM_IC3_SELECTION_MASK         (TIM_CCMOD2_CC3SEL)
#define TIM_IC4_SELECTION_MASK         (TIM_CCMOD2_CC4SEL)
/** TIM_Input_Capture_Selection **/
#define TIM_IC_SELECTION_DIRECTTI     (TIM_CCMOD1_CC1SEL_0) /* TIM Input 1, 2, 3 or 4 is selected to be connected to IC1, IC2, IC3 or IC4, respectively */
#define TIM_IC_SELECTION_INDIRECTTI   (TIM_CCMOD1_CC1SEL_1) /* TIM Input 1, 2, 3 or 4 is selected to be connected to IC2, IC1, IC4 or IC3, respectively. */
#define TIM_IC_SELECTION_TRC (TIM_CCMOD1_CC1SEL_1 | TIM_CCMOD1_CC1SEL_0) /* TIM Input 1, 2, 3 or 4 is selected to be connected to TRC. */

/** TIM_Input_Capture1_Filter **/
#define TIM_IC1_FILTER_MASK   (TIM_CCMOD1_IC1F)

/** TIM_Input_Capture2_Filter **/
#define TIM_IC2_FILTER_MASK   (TIM_CCMOD1_IC2F)

/** TIM_Input_Capture3_Filter **/
#define TIM_IC3_FILTER_MASK   (TIM_CCMOD2_IC3F)

/** TIM_Input_Capture4_Filter **/
#define TIM_IC4_FILTER_MASK   (TIM_CCMOD2_IC4F)

#define TIM_IC1_PSC_MASK     (TIM_CCMOD1_IC1PSC)
#define TIM_IC2_PSC_MASK     (TIM_CCMOD1_IC2PSC)
#define TIM_IC3_PSC_MASK     (TIM_CCMOD2_IC3PSC)
#define TIM_IC4_PSC_MASK     (TIM_CCMOD2_IC4PSC)
/** TIM_Input_Capture_Prescaler **/
#define TIM_IC_PSC_DIV1      (TIM_REG16_BIT_ZERO)
#define TIM_IC_PSC_DIV2      (TIM_CCMOD1_IC1PSC_0) /* Capture performed once every 2 events. */
#define TIM_IC_PSC_DIV4      (TIM_CCMOD1_IC1PSC_1) /* Capture performed once every 4 events. */
#define TIM_IC_PSC_DIV8      (TIM_CCMOD1_IC1PSC_1 | TIM_CCMOD1_IC1PSC_0) /* Capture performed once every 8 events. */

/** TIM_interrupt_sources **/
#define TIM_INT_UPDATE (TIM_STS_UDITF)
#define TIM_INT_CC1    (TIM_STS_CC1ITF)
#define TIM_INT_CC2    (TIM_STS_CC2ITF)
#define TIM_INT_CC3    (TIM_STS_CC3ITF)
#define TIM_INT_CC4    (TIM_STS_CC4ITF)
#define TIM_INT_COM    (TIM_STS_COMITF)
#define TIM_INT_TRIG   (TIM_STS_TITF)
#define TIM_INT_BREAK  (TIM_STS_BITF)


/** TIM_External_Trigger_Prescaler **/
#define TIM_EXT_TRG_PSC_MASK     (TIM_SMCTRL_EXTPS)
#define TIM_EXT_TRG_PSC_OFF      (TIM_REG16_BIT_ZERO)
#define TIM_EXT_TRG_PSC_DIV2     (TIM_SMCTRL_EXTPS_0)
#define TIM_EXT_TRG_PSC_DIV4     (TIM_SMCTRL_EXTPS_1)
#define TIM_EXT_TRG_PSC_DIV8     (TIM_SMCTRL_EXTPS_1 | TIM_SMCTRL_EXTPS_0)

#define TIM_TRIG_SEL_MASK    (TIM_SMCTRL_TSEL)
/** TIM_Internal_Trigger_Selection **/
#define TIM_TRIG_SEL_IN_TR0  (TIM_REG16_BIT_ZERO)
#define TIM_TRIG_SEL_IN_TR1  (TIM_SMCTRL_TSEL_0)
#define TIM_TRIG_SEL_IN_TR2  (TIM_SMCTRL_TSEL_1)
#define TIM_TRIG_SEL_IN_TR3  (TIM_SMCTRL_TSEL_1 | TIM_SMCTRL_TSEL_0)
#define TIM_TRIG_SEL_TI1F_ED (TIM_SMCTRL_TSEL_2)
#define TIM_TRIG_SEL_TI1FP1  (TIM_SMCTRL_TSEL_2 | TIM_SMCTRL_TSEL_0)
#define TIM_TRIG_SEL_TI2FP2  (TIM_SMCTRL_TSEL_2 | TIM_SMCTRL_TSEL_1)
#define TIM_TRIG_SEL_ETRF    (TIM_SMCTRL_TSEL_2 | TIM_SMCTRL_TSEL_1 | TIM_SMCTRL_TSEL_0)

/** TIM_TIx_External_Clock_Source **/
#define TIM_EXT_CLK_SRC_TI1   (TIM_SMCTRL_TSEL_2 | TIM_SMCTRL_TSEL_0)
#define TIM_EXT_CLK_SRC_TI2   (TIM_SMCTRL_TSEL_2 | TIM_SMCTRL_TSEL_1)
#define TIM_EXT_CLK_SRC_TI1ED (TIM_SMCTRL_TSEL_2)

/** TIM_External_Trigger_Polarity **/
#define TIM_EXT_TRIG_POLARITY_INVERTED    (TIM_SMCTRL_EXTP)
#define TIM_EXT_TRIG_POLARITY_NONINVERTED (TIM_REG16_BIT_ZERO)

/** TIM_TIx_External_Clock_Filter **/
#define TIM_EXT_TRIG_FILTER_MASK    (TIM_SMCTRL_EXTF)

/** TIM_External_Clock_Mode2 **/
#define TIM_EXT_CLOCK_MODE2_ENABLE    (TIM_SMCTRL_EXCEN)

#define TIM_PSC_RELOAD_MODE_MASK      (TIM_EVTGEN_UDGN)
/** TIM_Prescaler_Reload_Mode **/
#define TIM_PSC_RELOAD_MODE_UPDATE    (TIM_REG16_BIT_ZERO)
#define TIM_PSC_RELOAD_MODE_IMMEDIATE (TIM_EVTGEN_UDGN)



/** TIM_Event_Source **/
#define TIM_EVT_SRC_UPDATE  (TIM_EVTGEN_UDGN)
#define TIM_EVT_SRC_CC1     (TIM_EVTGEN_CC1GN)
#define TIM_EVT_SRC_CC2     (TIM_EVTGEN_CC2GN)
#define TIM_EVT_SRC_CC3     (TIM_EVTGEN_CC3GN)
#define TIM_EVT_SRC_CC4     (TIM_EVTGEN_CC4GN)
#define TIM_EVT_SRC_COM     (TIM_EVTGEN_CCUDGN)
#define TIM_EVT_SRC_TRIG    (TIM_EVTGEN_TGN)
#define TIM_EVT_SRC_BREAK   (TIM_EVTGEN_BGN)

