ljgabc/rtthread/bsp/n32g003/library/n32g003_tim.h
#define TIM_OC1_PRELOAD_MASK       (TIM_CCMOD1_OC1PEN)
#define TIM_OC2_PRELOAD_MASK       (TIM_CCMOD1_OC2PEN)
#define TIM_OC3_PRELOAD_MASK       (TIM_CCMOD2_OC3PEN)
#define TIM_OC4_PRELOAD_MASK       (TIM_CCMOD2_OC4PEN)
#define TIM_OC5_PRELOAD_MASK       (TIM_CCMOD3_OC5PEN)
/** TIM_Output_Compare_Preload_State **/
#define TIM_OC_PRELOAD_ENABLE      (TIM_CCMOD1_OC1PEN)
#define TIM_OC_PRELOAD_DISABLE     (TIM_REG16_BIT_ZERO)




#define TIM_OC1_FAST_MASK       (TIM_CCMOD1_OC1FEN)
#define TIM_OC2_FAST_MASK       (TIM_CCMOD1_OC2FEN)
#define TIM_OC3_FAST_MASK       (TIM_CCMOD2_OC3FEN)
#define TIM_OC4_FAST_MASK       (TIM_CCMOD2_OC4FEN)
#define TIM_OC5_FAST_MASK       (TIM_CCMOD3_OC5FEN)
/** TIM_Output_Compare_Fast_State **/
#define TIM_OC_FAST_ENABLE      (TIM_CCMOD1_OC1FEN)
#define TIM_OC_FAST_DISABLE     (TIM_REG16_BIT_ZERO)


#define TIM_OC1_CLEAR_MASK       (TIM_CCMOD1_OC1CEN)
#define TIM_OC2_CLEAR_MASK       (TIM_CCMOD1_OC2CEN)
#define TIM_OC3_CLEAR_MASK       (TIM_CCMOD2_OC3CEN)
#define TIM_OC4_CLEAR_MASK       (TIM_CCMOD2_OC4CEN)
#define TIM_OC5_CLEAR_MASK       (TIM_CCMOD3_OC5CEN)
/** TIM_Output_Compare_Clear_State **/
#define TIM_OC_CLEAR_ENABLE      (TIM_CCMOD1_OC1CEN)
#define TIM_OC_CLEAR_DISABLE     (TIM_REG16_BIT_ZERO)

#define TIM_TRGO_SRC_MASK            (TIM_CTRL2_MMSEL)
/** TIM_Trigger_Output_Source **/
#define TIM_TRGO_SRC_RESET           (TIM_REG16_BIT_ZERO)
#define TIM_TRGO_SRC_ENABLE          (TIM_CTRL2_MMSEL_0)
#define TIM_TRGO_SRC_UPDATE          (TIM_CTRL2_MMSEL_1)
#define TIM_TRGO_SRC_OC1             (TIM_CTRL2_MMSEL_1 | TIM_CTRL2_MMSEL_0)
#define TIM_TRGO_SRC_OC1REF          (TIM_CTRL2_MMSEL_2)
#define TIM_TRGO_SRC_OC2REF          (TIM_CTRL2_MMSEL_2 | TIM_CTRL2_MMSEL_0)
#define TIM_TRGO_SRC_OC3REF          (TIM_CTRL2_MMSEL_2 | TIM_CTRL2_MMSEL_1)
#define TIM_TRGO_SRC_OC4REF          (TIM_CTRL2_MMSEL_2 | TIM_CTRL2_MMSEL_1 | TIM_CTRL2_MMSEL_0)

/** ETR selection **/
#define TIM_ETR_Seletct_ExtGpio                 (TIM_REG16_BIT_ZERO)
#define TIM_ETR_Seletct_innerTsc                (TIM_CTRL2_TSCSEL)

#define TIM_SLAVE_MODE_MASK  (TIM_SMCTRL_SMSEL)
/** TIM_Slave_Mode **/
#define TIM_SLAVE_MODE_RESET (TIM_SMCTRL_SMSEL_2)
#define TIM_SLAVE_MODE_GATED (TIM_SMCTRL_SMSEL_2 | TIM_SMCTRL_SMSEL_0)
#define TIM_SLAVE_MODE_TRIG  (TIM_SMCTRL_SMSEL_2 | TIM_SMCTRL_SMSEL_1)
#define TIM_SLAVE_MODE_EXT1  (TIM_SMCTRL_SMSEL_2 | TIM_SMCTRL_SMSEL_1 | TIM_SMCTRL_SMSEL_0)

#define TIM_MASTER_SLAVE_MODE_MASK    (TIM_SMCTRL_MSMD)
/** TIM_Master_Slave_Mode **/
#define TIM_MASTER_SLAVE_MODE_ENABLE  (TIM_SMCTRL_MSMD)
#define TIM_MASTER_SLAVE_MODE_DISABLE (TIM_REG16_BIT_ZERO)

/** TIM_Flags **/
#define TIM_FLAG_UPDATE (TIM_STS_UDITF)
#define TIM_FLAG_CC1    (TIM_STS_CC1ITF)
#define TIM_FLAG_CC2    (TIM_STS_CC2ITF)
#define TIM_FLAG_CC3    (TIM_STS_CC3ITF)
#define TIM_FLAG_CC4    (TIM_STS_CC4ITF)
#define TIM_FLAG_COM    (TIM_STS_COMITF)
#define TIM_FLAG_TRIG   (TIM_STS_TITF)
#define TIM_FLAG_BREAK  (TIM_STS_BITF)
#define TIM_FLAG_CC1OF  (TIM_STS_CC1OCF)
#define TIM_FLAG_CC2OF  (TIM_STS_CC2OCF)
#define TIM_FLAG_CC3OF  (TIM_STS_CC3OCF)
#define TIM_FLAG_CC4OF  (TIM_STS_CC4OCF)
#define TIM_FLAG_CC5    (TIM_STS_CC5ITF)

/** TIM_CCxEN **/
#define TIM_CC1EN        (TIM_CCEN_CC1EN)
#define TIM_CC1NEN       (TIM_CCEN_CC1NEN)
#define TIM_CC2EN        (TIM_CCEN_CC2EN)
#define TIM_CC2NEN       (TIM_CCEN_CC2NEN)
#define TIM_CC3EN        (TIM_CCEN_CC3EN)
#define TIM_CC3NEN       (TIM_CCEN_CC3NEN)
#define TIM_CC4EN        (TIM_CCEN_CC4EN)
#define TIM_CC5EN        (TIM_CCEN_CC5EN)


/** TIM_CCxP **/
#define TIM_CC1P    (TIM_CCEN_CC1P)
#define TIM_CC1NP   (TIM_CCEN_CC1NP)
#define TIM_CC2P    (TIM_CCEN_CC2P)
#define TIM_CC2NP   (TIM_CCEN_CC2NP)
#define TIM_CC3P    (TIM_CCEN_CC3P)
#define TIM_CC3NP   (TIM_CCEN_CC3NP)
#define TIM_CC4P    (TIM_CCEN_CC4P)
#define TIM_CC5P    (TIM_CCEN_CC5P)

/* TIM_CCDATx*/
#define TIM_CCDAT1_MASK           (TIM_CCDAT1_CCDAT1)
#define TIM_CCDAT2_MASK           (TIM_CCDAT2_CCDAT2)
#define TIM_CCDAT3_MASK           (TIM_CCDAT3_CCDAT3)
#define TIM_CCDAT4_MASK           (TIM_CCDAT4_CCDAT4)


/* ---------------------- TIM registers bit mask ------------------------ */
#define SMCTRL_ETRP_MASK            ((uint16_t)0x8000)
#define SMCTRL_ETRCEN_MASK          ((uint16_t)0x4000)
#define SMCTRL_ETRPSC_MASK          ((uint16_t)0x3000)
#define SMCTRL_ETRFIL_MASK          ((uint16_t)0x0f00)
#define CAPCMPMOD_OFFSET            ((uint16_t)0x0018)
#define CAPCMPEN_CCE_SET            ((uint16_t)0x0001)
#define CAPCMPEN_CCNE_SET           ((uint16_t)0x0004)


void TIM_Reset(TIM_Module* TIMx);

/** TIM_Base functions **/
void TIM_Base_Count_Mode_Set(TIM_Module* TIMx, uint32_t cnt_mode);

/* function in N32G003 */
void TIM_Base_Auto_Reload_Set(TIM_Module* TIMx, uint16_t auto_reload);
void TIM_Base_Prescaler_Set(TIM_Module* TIMx, uint16_t prescaler);
void TIM_Base_Reload_Mode_Set(TIM_Module* TIMx, uint16_t reload_mode);
void TIM_Base_Count_Set(TIM_Module* TIMx, uint16_t count);
uint16_t TIM_Base_Count_Get(TIM_Module* TIMx);
uint16_t TIM_Auto_Reload_Get(TIM_Module* TIMx);
uint16_t TIM_Base_Prescaler_Get(TIM_Module* TIMx);
void TIM_Base_Repeat_Count_Set(TIM_Module* TIMx, uint8_t repeat_cnt);
void TIM_Base_Channel1(TIM_Module* TIMx, bool channel_selection);
void TIM_Base_OCrefClear(TIM_Module* TIMx, bool OCrefClear_selection);
void TIM_Base_Initialize(TIM_Module* TIMx, TIM_TimeBaseInitType* TIM_TimeBaseInitStruct);
void TIM_Base_Struct_Initialize(TIM_TimeBaseInitType* TIM_TimeBaseInitStruct);
void TIM_On(TIM_Module* TIMx);
void TIM_Off(TIM_Module* TIMx);

/** Preload functions **/
void TIM_Output_Channel1_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload);
void TIM_Output_Channel2_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload);
void TIM_Output_Channel3_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload);
void TIM_Output_Channel4_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload);
void TIM_Output_Channel5_Preload_Set(TIM_Module* TIMx, uint16_t TIM_output_channel_preload);
void TIM_Auto_Reload_Preload_Enable(TIM_Module* TIMx);
void TIM_Auto_Reload_Preload_Disable(TIM_Module* TIMx);
void TIM_Update_Event_Enable(TIM_Module* TIMx);
void TIM_Update_Event_Disable(TIM_Module* TIMx);
void TIM_Update_Request_Source_Set(TIM_Module* TIMx, uint16_t TIM_update_source);
void TIM_Event_Generate(TIM_Module* TIMx, uint16_t TIM_event_source);
void TIM_Commutation_Event_Enable(TIM_Module* TIMx); 
void TIM_Commutation_Event_Disable(TIM_Module* TIMx); 
void TIM_Capture_Compare_Control_Preload_Enable(TIM_Module* TIMx);
void TIM_Capture_Compare_Control_Preload_Disable(TIM_Module* TIMx);

/** Channel functions **/
void TIM_Compare1_Set(TIM_Module* TIMx, uint16_t compare1);
void TIM_Compare2_Set(TIM_Module* TIMx, uint16_t compare2);
void TIM_Compare3_Set(TIM_Module* TIMx, uint16_t compare3);
void TIM_Compare4_Set(TIM_Module* TIMx, uint16_t compare4);
void TIM_Compare5_Set(TIM_Module* TIMx, uint16_t compare5);
uint16_t TIM_Compare_Capture1_Get(TIM_Module* TIMx);
uint16_t TIM_Compare_Capture2_Get(TIM_Module* TIMx);
uint16_t TIM_Compare_Capture3_Get(TIM_Module* TIMx);
uint16_t TIM_Compare_Capture4_Get(TIM_Module* TIMx);
uint16_t TIM_Compare_Capture5_Get(TIM_Module* TIMx);
FlagStatus TIM_CCEN_Status_Get(TIM_Module* TIMx, uint32_t TIM_CCEN);

